       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO_WORLD.
       AUTHOR. FILIP JANJESIC.

       PROCEDURE DIVISION.
           DISPLAY "Hello, World!".
           ACCEPT OMITTED.
           STOP RUN.
