       IDENTIFICATION DIVISION.
              PROGRAM-ID. HELLO_WORLD.
              PROCEDURE DIVISION.
                  DISPLAY "Hello, World!".
                  STOP RUN.
                END PROGRAM HELLO_WORLD.
       